import streamlit as st

st.title("ברוכים הבאים לגרסת הדמו של מבחן הכלפים")
st.write("""
### הסבר
- כל שלב מורכב מקלף מטרה ו4 אפשרויות בחירה
- ישנו רק קלף אחד שמתאים לקלף המטרה בהתבסס על חוק
         החוק כולל התאמה בין שני מאפיינים של הקלף
- אם בחרת בקלף הנכון - תקבל נקודה אחת
- אם בחרת בקלף בו אחד המאפיינים מתאים - תקבל הודעה כי התשובה שלך כמעט נכונה
- כל מספר שלבים מתחלף החוק בלי להזהיר מראש
!!!שימו לב!!!
    עד צעד 10 אין להתייחס למאפיין אשר מופיע בכל הקלפים (המאפיין כאילו לא קיים)
""")

if st.button("Start the test"):
    st.switch_page("app.py")   # Name of your main file